CSI API ETABS v1
cLinkObj.AddByCoord Method
 Adds a new link object whose end points are at the specified coordinates.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int AddByCoord(
	double XI,
	double YI,
	double ZI,
	double XJ,
	double YJ,
	double ZJ,
	ref string Name,
	bool IsSingleJoint = false,
	string PropName = "Default",
	string UserName = "",
	string CSys = "Global"
)
Function AddByCoord (
	XI As Double,
	YI As Double,
	ZI As Double,
	XJ As Double,
	YJ As Double,
	ZJ As Double,
	ByRef Name As String,
	Optional IsSingleJoint As Boolean = false,
	Optional PropName As String = "Default",
	Optional UserName As String = "",
	Optional CSys As String = "Global"
) As Integer
Dim instance As cLinkObj
Dim XI As Double
Dim YI As Double
Dim ZI As Double
Dim XJ As Double
Dim YJ As Double
Dim ZJ As Double
Dim Name As String
Dim IsSingleJoint As Boolean
Dim PropName As String
Dim UserName As String
Dim CSys As String
Dim returnValue As Integer
returnValue = instance.AddByCoord(XI,
	YI, ZI, XJ, YJ, ZJ, Name, IsSingleJoint,
	PropName, UserName, CSys)
int AddByCoord(
	double XI,
	double YI,
	double ZI,
	double XJ,
	double YJ,
	double ZJ,
	String^% Name,
	bool IsSingleJoint = false,
	String^ PropName = L"Default",
	String^ UserName = L"",
	String^ CSys = L"Global"
)
abstract AddByCoord :
        XI : float *
        YI : float *
        ZI : float *
        XJ : float *
        YJ : float *
        ZJ : float *
        Name : string byref *
        ?IsSingleJoint : bool *
        ?PropName : string *
        ?UserName : string *
        ?CSys : string
(* Defaults:
        let _IsSingleJoint = defaultArg IsSingleJoint false
        let _PropName = defaultArg PropName "Default"
        let _UserName = defaultArg UserName ""
        let _CSys = defaultArg CSys "Global"
*)
-> int
Parameters
XI
Type: System.Double
The X coordinate of the I-End of the added link object in the coordinate system defined by the CSys item.
YI
Type: System.Double
The Y coordinate of the I-End of the added link object in the coordinate system defined by the CSys item.
ZI
Type: System.Double
The Z coordinate of the I-End of the added link object in the coordinate system defined by the CSys item.
XJ
Type: System.Double
The X coordinate of the J-End of the added link object in the coordinate system defined by the CSys item.
YJ
Type: System.Double
The Y coordinate of the J-End of the added link object in the coordinate system defined by the CSys item.
ZJ
Type: System.Double
The Z coordinate of the J-End of the added link object in the coordinate system defined by the CSys item.
Name
Type: System.String
This is the name that the program ultimately assigns for the link object. If no UserName is specified, the program assigns a default name to the link object. If a UserName is specified and that name is not used for another link object, the UserName is assigned to the link object; otherwise a default name is assigned to the link object.
IsSingleJoint (Optional)
Type: System.Boolean
This item is True if a one-joint link is added and False if a two-joint link is added.
PropName (Optional)
Type: System.String
This is either Default or the name of a defined link property.
If it is Default the program assigns a default link property to the link object. If it is the name of a defined link property, that property is assigned to the link object
UserName (Optional)
Type: System.String
CSys (Optional)
Type: System.String
The name of the coordinate system in which the link object end point coordinates are defined.
Return Value
Type: Int32
Returns zero if the link object is successfully added; otherwise it returns a nonzero value.
Remarks
One-joint links are not supported in ETABS.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name1 As String
       Dim Name2 As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link object by coordinates
       ret = SapModel.LinkObj.AddByCoord(-288, 0, 288, 0, 0, 0, Name1, True)
       ret = SapModel.LinkObj.AddByCoord(-288, 0, 0, 0, 0, 144, Name2)
   'refresh view
       ret = SapModel.View.RefreshView
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLinkObj Interface
ETABSv1 Namespace